

// +Задача 25: Напишите цикл, который принимает на вход два числа (A и B) и возводит число A в натуральную степень B.

// 3, 5 -> 243 (3⁵)

// 2, 4 -> 16

// Console.WriteLine("Введите число:");
// int A = Convert.ToInt32(Console.ReadLine());
// Console.WriteLine("Введите , в степень которого вы хотите возвести предыдущее число:");
// int B = Convert.ToInt32(Console.ReadLine());
// double pow = Math.Pow(A,B);

// Console.WriteLine(pow);

// Задача 27: Напишите программу, которая принимает на вход число и выдаёт сумму цифр в числе.

// 452 -> 11

// 82 -> 10

// // 9012 -> 12
// Console.WriteLine("Введите число:");
// int A = Convert.ToInt32(Console.ReadLine());
// int sum=0;

//     while(A!=0)
//     {
// sum = sum + A%10;
// A /=10;
//     }
// Console.WriteLine($"Сумма цифр в числе = {sum}");





//+ Задача 29: Напишите программу, которая задаёт массив из 8 элементов и выводит их на экран.

// 1, 2, 5, 7, 19 -> [1, 2, 5, 7, 19]

// // 6, 1, 33 -> [6, 1, 33]


        //      Console.Write("Введите первое число: ");
        //     var number1 = Convert.ToInt32(Console.ReadLine());
        //     Console.Write("Введите второе число: ");
        //     var number2 = Convert.ToInt32(Console.ReadLine());
        //       Console.Write("Введите третье число: ");
        //     var number3 = Convert.ToInt32(Console.ReadLine());
        //     Console.Write("Введите четвертое число: ");
        //     var number4 = Convert.ToInt32(Console.ReadLine());
        //       Console.Write("Введите пятое число: ");
        //     var number5 = Convert.ToInt32(Console.ReadLine());
        //     Console.Write("Введите шестое число: ");
        //     var number6 = Convert.ToInt32(Console.ReadLine());
        //       Console.Write("Введите седьмое число: ");
        //     var number7 = Convert.ToInt32(Console.ReadLine());
        //     Console.Write("Введите восьмое число: ");
        //     var number8 = Convert.ToInt32(Console.ReadLine());
          
        //         var array = new int [8] {number1,number2,number3,number4,number5,number6,number7,number8};
                
        //      foreach(var value in array)
        // Console.Write( $";" + value);